Revit 2024 API
BuiltInFailures.DesignOptionFailures.NoSelectedInOption Property
 None of the selected elements can be added to this Option Set. The following warnings provide additional information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoSelectedInOption { get; }
Visual Basic
Public Shared ReadOnly Property NoSelectedInOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoSelectedInOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace